ezois_ka/oooezoiskaobmen.vssoft_ka_ooo_ezois/src/Enums/ХозяйственныеОперации/ХозяйственныеОперации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="351b0c5b-74c3-4aaa-a93b-7246b941f797">
  <name>ХозяйственныеОперации</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues extendedConfigurationObject="1e18177a-fe02-4999-a369-fb008fe9fd42">
    <name>ПеречислениеВБюджет</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="692215c8-f484-4e22-b24f-430cd2009fae">
    <name>ОплатаДенежныхСредствВДругуюОрганизацию</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="95818758-8542-4405-8773-6b644d757e22">
    <name>ВыдачаДенежныхСредствПодотчетнику</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="1879ad4f-47e1-438b-9738-f1429bc3c780">
    <name>ПеречислениеТаможне</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="da785c97-98fb-4ee6-8990-f175fe8496ef">
    <name>КонвертацияВалюты</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="b5771beb-5568-450d-963a-bfe9090b7f8c">
    <name>ВыдачаЗаймов</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="1923f574-7981-46df-b96d-b293c2f88d8c">
    <name>ОплатаПоставщику</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="a07305c5-0d5c-4195-8220-2eb29fa05ef5">
    <name>ВнутренняяПередачаДенежныхСредств</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="d0e70b4c-e687-4b56-a586-c641aa8d81ae">
    <name>ВыплатаЗарплаты</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="2d869152-e27f-4d56-a690-de6ac662ace2">
    <name>ОплатаПоКредитам</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="572c15b7-b781-43a9-91fb-eecc7ecffee8">
    <name>ПеречислениеНаДепозиты</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="6915db6f-cc8d-4766-aca9-84cf48edcd58">
    <name>ВыдачаЗаймаСотруднику</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="693adf02-fccb-4cd9-a092-f9fa532b7983">
    <name>ПрочаяВыдачаДенежныхСредств</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="724dc975-c8d5-4eea-b4af-52c1b39555e5">
    <name>ВозвратОплатыКлиенту</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="51ad2381-0d1f-4a17-823e-32dfa2be2232">
    <name>ВозвратДенежныхСредствВДругуюОрганизацию</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="b4199927-65e9-4e54-90f9-456e4c68a93f">
    <name>ВыплатаЗарплатыПоЗарплатномуПроекту</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="6d079ef6-b405-487d-9ff8-d6cbe795713f">
    <name>ВыплатаЗарплатыНаЛицевыеСчета</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="240b34c3-b18a-47c5-9f2f-bd241e23e42a">
    <name>ВыплатаЗарплатыЧерезКассу</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="aee89418-2c06-47ad-bf28-064f762e59aa">
    <name>ВозвратОплатыНаПлатежнуюКарту</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="15ce947b-5b8c-4087-b372-2f3f60dedd76">
    <name>ОплатаАрендодателю</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="82e6dbf8-d7ba-4382-9880-9e83d175a158">
    <name>СписаниеТоваровПоТребованию</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="f675a52b-940a-480e-8374-c64ff49e4478">
    <name>СборкаТоваров</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="ad2322ce-9ed5-4e79-ace7-6f03b97d9445">
    <name>РазборкаТоваров</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

ezois_ka/oooezoiskaobmen.vssoft_ka_ooo_ezois/src/Documents/ЗаявкаНаРасходованиеДенежныхСредств/ЗаявкаНаРасходованиеДенежныхСредств.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="c97305dd-0349-4b67-ba20-a37c9742ec79">
  <name>ЗаявкаНаРасходованиеДенежныхСредств</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes extendedConfigurationObject="b3ae4863-066d-4a33-a16f-4784c4f0c0be">
    <name>ДокументОснование</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <tabularSections extendedConfigurationObject="cbfe7c8f-54c1-43a8-ad59-1e976148c661">
    <name>РасшифровкаПлатежа</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="4184318b-77c1-444a-a5bb-92436bb697d0">
      <name>Ведомость</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="6e894b08-f37c-4bda-9362-6cc679053505">
      <name>АналитикаРасходов</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="08846a81-f592-44b1-b735-efa7b62be0de">
      <name>ДоговорЗаймаСотруднику</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="e7b07503-1def-4154-b588-a112466b8295">
      <name>ОбъектРасчетов</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
</mdclass:Document>

ezois_ka/oooezoiskaobmen.vssoft_ka_ooo_ezois/src/Documents/СписаниеБезналичныхДенежныхСредств/СписаниеБезналичныхДенежныхСредств.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="8502b653-32a8-4d01-a12e-5fe4cede91ef">
  <name>СписаниеБезналичныхДенежныхСредств</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes extendedConfigurationObject="cd15c091-bd29-4240-9b9b-92e2ef41be4f">
    <name>ЗаявкаНаРасходованиеДенежныхСредств</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="579b3859-afee-4d21-9a84-eee2623b1f8a">
    <name>ДокументОснование</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="52f152ae-59b7-498b-993e-c1526535a48e">
    <name>СторнируемыйДокумент</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="5f1c2fb7-9fb6-4feb-8949-d844a992daa7">
    <name>РаспоряжениеНаПеремещениеДенежныхСредств</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <tabularSections extendedConfigurationObject="ab2b4e73-8dc2-4506-995b-60a7baebb5de">
    <name>РасшифровкаПлатежа</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="8fc8ec59-2f16-4535-b3ae-26184042916f">
      <name>Ведомость</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="ede8b9a2-bebf-4253-be54-706b95a2ad91">
      <name>АналитикаРасходов</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="c3bf0fca-b662-4fb3-b2da-5b560803e9ad">
      <name>ЗаявкаНаРасходованиеДенежныхСредств</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="173a7a3d-ba58-49c0-92ce-5abb404aa5b4">
      <name>ДоговорЗаймаСотруднику</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="ce51c9c3-3c38-4119-b28a-2ce3e7ec8dcf">
      <name>ОбъектРасчетов</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
</mdclass:Document>

ezois_ka/oooezoiskaobmen.vssoft_ka_ooo_ezois/src/Documents/РасходныйКассовыйОрдер/РасходныйКассовыйОрдер.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="eae285fe-79a3-4d70-a64b-ccacfcabc3fb">
  <name>РасходныйКассовыйОрдер</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes extendedConfigurationObject="a7cb098e-5a0b-480f-ad1b-c4b6d80a674c">
    <name>Ведомость</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="de8d486b-3f73-4f3f-8b1a-c9dfc969d5c5">
    <name>ЗаявкаНаРасходованиеДенежныхСредств</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="048cae9e-5d50-4239-ac6e-52ae09f8ac3a">
    <name>РаспоряжениеНаПеремещениеДенежныхСредств</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="f39165b5-1d2b-41e7-bc4f-0d957b66a1a9">
    <name>ДокументОснование</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="81d6ab19-dc54-48b7-871a-5335690ead02">
    <name>СторнируемыйДокумент</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <tabularSections extendedConfigurationObject="16b830e6-fd77-4f5a-8777-64507f5487f4">
    <name>РасшифровкаПлатежа</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="ae739aa9-8ef0-40da-8e6e-01021e6a9b54">
      <name>ДоговорЗаймаСотруднику</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="a8fd9715-38bb-4052-8785-9f3ae25505b2">
      <name>ОбъектРасчетов</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="320be379-285d-4fcc-9cd9-2ee51ad58611">
      <name>АналитикаРасходов</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="58769c5f-fa49-42e7-8a96-9707f7d52bfb">
      <name>ЗаявкаНаРасходованиеДенежныхСредств</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
</mdclass:Document>

ezois_ka/oooezoiskaobmen.vssoft_ka_ooo_ezois/src/CommonModules/ДенежныеСредстваСервер/Module.bsl
&ИзменениеИКонтроль("ЗаполнитьДокументПоЗаявкамНаРасходованиеДенежныхСредств")
Процедура vs_ЗаполнитьДокументПоЗаявкамНаРасходованиеДенежныхСредств(ДанныеЗаполнения, ТабличнаяЧасть, ФормаОплаты, Документ)
	
	МассивСсылок = Новый Массив; СуммыКОплате = Неопределено;
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ЗаявкаНаРасходованиеДенежныхСредств")
		Или ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ЗаявкаНаКомандировку") Тогда
		МассивСсылок.Добавить(ДанныеЗаполнения);
		БанковскийСчетКасса = Неопределено;
		СуммаПлатежа = 0;
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("Структура") Тогда
		Если ТипЗнч(ДанныеЗаполнения.ДокументОснование) = Тип("ДокументСсылка.ЗаявкаНаРасходованиеДенежныхСредств")
			Или ТипЗнч(ДанныеЗаполнения.ДокументОснование) = Тип("ДокументСсылка.ЗаявкаНаКомандировку") Тогда
			МассивСсылок.Добавить(ДанныеЗаполнения.ДокументОснование);
		ИначеЕсли ТипЗнч(ДанныеЗаполнения.ДокументОснование) = Тип("Массив") Тогда
			МассивСсылок = ДанныеЗаполнения.ДокументОснование;
		КонецЕсли;
		БанковскийСчетКасса = ДанныеЗаполнения.БанковскийСчетКасса;
		СуммаПлатежа = ДанныеЗаполнения.Сумма;
		ДанныеЗаполнения.Свойство("СуммыКОплате", СуммыКОплате);
	КонецЕсли;
	
	ЗапросОстатков = Новый Запрос;
	ЗапросОстатков.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	ЗапросОстатков.УстановитьПараметр("МассивСсылок", МассивСсылок);
	
	БанковскиеСчетаКассы = Новый Массив;
	Если ЗначениеЗаполнено(БанковскийСчетКасса) Тогда
		БанковскиеСчетаКассы.Добавить(БанковскийСчетКасса);
		БанковскиеСчетаКассы.Добавить(Неопределено);
		ЗапросОстатков.УстановитьПараметр("БанковскиеСчетаКассы", БанковскиеСчетаКассы);
		ЗапросОстатков.УстановитьПараметр("НеОграничиватьПоБанковскомуСчетуКассе", Ложь);
	Иначе
		ЗапросОстатков.УстановитьПараметр("БанковскиеСчетаКассы", БанковскиеСчетаКассы);
		ЗапросОстатков.УстановитьПараметр("НеОграничиватьПоБанковскомуСчетуКассе", Истина);
	КонецЕсли;
	
	ЗапросОстатков.УстановитьПараметр("Регистратор", Документ);
	
	ЗапросОстатков.Текст = ТекстЗапросаОстатковКВыплате();
	
	УстановитьПривилегированныйРежим(Истина);
	ЗапросОстатков.Выполнить();
	УстановитьПривилегированныйРежим(Ложь);

	ТекстЗапроса = "
	|ВЫБРАТЬ
	|	Заявка.Организация КАК Организация,
	|	ВЫБОР
	|		КОГДА Заявка.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВыплатаЗарплаты) ТОГДА
	|			Заявка.ХозяйственнаяОперацияПоЗарплате
	|		ИНАЧЕ
	|			Заявка.ХозяйственнаяОперация
	|	КОНЕЦ КАК ХозяйственнаяОперация,
	|	Заявка.Валюта КАК Валюта,
	|	Заявка.Валюта КАК ВалютаЗаявки,
	|	Заявка.БанковскийСчет КАК БанковскийСчет,
	|	Заявка.Касса КАК Касса,
	|	Заявка.НазначениеПлатежа КАК НазначениеПлатежа,
	|	Заявка.Контрагент КАК Контрагент,
	|	ВЫБОР КОГДА НЕ Заявка.БанковскийСчетКонтрагента.Закрыт ТОГДА
	|		Заявка.БанковскийСчетКонтрагента
	|	ИНАЧЕ
	|		НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК БанковскийСчетКонтрагента,
	|	Заявка.БанковскийСчетКонтрагента.ВалютаДенежныхСредств КАК БанковскийСчетКонтрагентаВалюта,
	|	Заявка.ПодотчетноеЛицо КАК ПодотчетноеЛицо,
	|	ВЫБОР КОГДА НЕ Заявка.БанковскийСчетПолучатель.Закрыт ТОГДА
	|		Заявка.БанковскийСчетПолучатель
	|	ИНАЧЕ
	|		НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК БанковскийСчетПолучатель,
	|	Заявка.БанковскийСчетПолучатель.ВалютаДенежныхСредств КАК БанковскийСчетПолучательВалюта,
	|	Заявка.КассаПолучатель КАК КассаПолучатель,
	|	Заявка.Подразделение КАК Подразделение,
	|	Заявка.ФормаОплатыЗаявки КАК ФормаОплатыЗаявки,
	|	Заявка.СтатьяДвиженияДенежныхСредств КАК СтатьяДвиженияДенежныхСредств,
	|	Заявка.ВалютаКонвертации КАК ВалютаКонвертации,
	|	Заявка.СуммаКонвертации КАК СуммаКонвертации,
	|	Заявка.КурсКонвертации КАК КурсКонвертации,
	|	Заявка.КратностьКурсаКонвертации КАК КратностьКурсаКонвертации,
	|	Заявка.ПланированиеСуммы КАК ПланированиеСуммы,
	|	Заявка.НомерВедомостиНаВыплатуЗарплаты КАК НомерВедомостиНаВыплатуЗарплаты,
	|	Заявка.ДатаВедомостиНаВыплатуЗарплаты КАК ДатаВедомостиНаВыплатуЗарплаты,
	|	Заявка.СтатьяАктивовПассивов КАК СтатьяАктивовПассивов,
	|	Заявка.АналитикаАктивовПассивов КАК АналитикаАктивовПассивов,
	|	Заявка.ИдентификаторПлатежа КАК ИдентификаторПлатежа,
	|	Заявка.ДатаАвансовогоОтчета КАК ДатаАвансовогоОтчета,
	//++ НЕ УТ
	|	Заявка.ДоговорСУчастникомГОЗ КАК ДоговорСУчастникомГОЗ,
	|	Заявка.ПлатежиПо275ФЗ КАК ПлатежиПо275ФЗ,
	|	Заявка.ТипПлатежаФЗ275 КАК ТипПлатежаФЗ275,
	|	Заявка.БанковскийСчет.ГосударственныйКонтракт КАК ГосКонтракт,
	|	Заявка.СтатьяЦелевыхСредств КАК СтатьяЦелевыхСредств,
	//-- НЕ УТ
	|	Заявка.ПеречислениеВБюджет КАК ПеречислениеВБюджет,
	|	Заявка.ТипНалога КАК ТипНалога,
	|	Заявка.НДФЛПоВедомостям КАК НДФЛПоВедомостям,
	|	Заявка.РегистрацияВНалоговомОргане КАК РегистрацияВНалоговомОргане,
	|	Заявка.ВидПеречисленияВБюджет КАК ВидПеречисленияВБюджет,
	|	Заявка.КодОКАТО КАК КодОКАТО,
	|	Заявка.ПоказательОснования КАК ПоказательОснования,
	|	Заявка.ПоказательПериода КАК ПоказательПериода,
	|	Заявка.ПоказательНомера КАК ПоказательНомера,
	|	Заявка.ПоказательДаты КАК ПоказательДаты,
	|	Заявка.ПоказательТипа КАК ПоказательТипа,
	|	Заявка.СтатусСоставителя КАК СтатусСоставителя,
	|	Заявка.КодБК КАК КодБК,
	|	Заявка.КодВидаДохода КАК КодВидаДохода,
	|	Заявка.КодВыплат КАК КодВыплат,
	|	Заявка.ДоговорЭквайринга КАК ДоговорЭквайринга,
	|	Заявка.ОтражатьКомиссию КАК ОтражатьКомиссию,
	|	Заявка.СуммаКомиссии КАК СуммаКомиссии,
	|	Заявка.СтатьяРасходов КАК СтатьяРасходов,
	|	Заявка.АналитикаРасходов КАК АналитикаРасходов,
	|	Заявка.Подразделение КАК ПодразделениеРасходов,
	//++ НЕ УТ
	|	Заявка.НастройкаСчетовУчета КАК НастройкаСчетовУчета,
	//-- НЕ УТ
	|	Заявка.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВыплатаЗарплаты) КАК ЭтоВыплатаЗарплаты,
	|	ВЫБОР
	|		КОГДА Заявка.ХозяйственнаяОперация В (
	|			ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВыдачаДенежныхСредствПодотчетнику),
	|			ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВыдачаЗаймаСотруднику))
	|		ТОГДА
	|			Заявка.ПодотчетноеЛицо.Наименование
	|		ИНАЧЕ
	|			ВЫБОР
	|				КОГДА Заявка.Контрагент.НаименованиеПолное <> """" ТОГДА
	|					Заявка.Контрагент.НаименованиеПолное
	|				ИНАЧЕ
	|					Заявка.Контрагент.Наименование
	|			КОНЕЦ
	|	КОНЕЦ КАК Выдать,
	|	ИСТИНА КАК ОплатаПоЗаявкам,
	|	Заявка.ИННПлательщика КАК ИННПлательщика,
	|	Заявка.КПППлательщика КАК КПППлательщика,
	|	Заявка.ТекстПлательщика КАК ТекстПлательщика,
	|	Заявка.ГруппаФинансовогоУчета КАК ГруппаФинансовогоУчета,
	|	Заявка.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|	Заявка.Договор КАК Договор,
	|	Заявка.Ссылка КАК ЗаявкаНаРасходованиеДенежныхСредств,
	|	Заявка.ДокументОснование КАК ДокументОснованиеЗаявки,
	|	Заявка.ДокументОснование.ИдентификаторОплатыСБП КАК ИдентификаторОплатыСБП,
	|	ВЫБОР
	|		КОГДА Заявка.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВыплатаЗарплаты) ТОГДА
	|			3
	|	КОНЕЦ КАК ОчередностьПлатежа,
	|	Заявка.ТипКомиссииЗаПеревод КАК ТипКомиссииЗаПеревод,
	|	Заявка.ИнформацияПолучателюПлатежа КАК ИнформацияПолучателюПлатежа,
	|	Заявка.УсловиеСделкиКонвертации КАК УсловиеСделкиКонвертации,
	|	Заявка.БанковскийСчетСписанияКомиссии КАК БанковскийСчетСписанияКомиссии,
	|	Заявка.НалогообложениеНДС КАК НалогообложениеНДС,
	|	Заявка.ПеречислениеСотрудникуЧерезБанк КАК ПеречислениеСотрудникуЧерезБанк,
	|	Заявка.СписокФизЛиц КАК СписокФизЛиц,
	|	Заявка.ПлатежСКонвертацией КАК ПлатежСКонвертацией,
	|	Заявка.СписокКонтрагентов КАК СписокКонтрагентов,
	|	Заявка.ОперацияССамозанятым КАК ОперацияССамозанятым
	|
	|ИЗ
	|	Документ.ЗаявкаНаРасходованиеДенежныхСредств КАК Заявка
	|	
	|ГДЕ
	|	Заявка.Ссылка В (&МассивСсылок)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Заявка.Организация КАК Организация,
	|	ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВыдачаДенежныхСредствПодотчетнику) КАК ХозяйственнаяОперация,
	|	Заявка.Валюта КАК Валюта,
	|	Заявка.Валюта КАК ВалютаЗаявки,
	|	Заявка.БанковскийСчет КАК БанковскийСчет,
	|	Заявка.Касса КАК Касса,
	|	"""" КАК НазначениеПлатежа,
	|	НЕОПРЕДЕЛЕНО КАК Контрагент,
	|	Заявка.ЛицевойСчет КАК БанковскийСчетКонтрагента,
	|	Заявка.ЛицевойСчет.ВалютаДенежныхСредств КАК БанковскийСчетКонтрагентаВалюта,
	|	Заявка.Сотрудник КАК ПодотчетноеЛицо,
	|	НЕОПРЕДЕЛЕНО КАК БанковскийСчетПолучатель,
	|	НЕОПРЕДЕЛЕНО КАК БанковскийСчетПолучательВалюта,
	|	НЕОПРЕДЕЛЕНО КАК КассаПолучатель,
	|	Заявка.Подразделение КАК Подразделение,
	|	Заявка.ФормаОплатыЗаявки КАК ФормаОплатыЗаявки,
	|	Заявка.СтатьяДвиженияДенежныхСредств КАК СтатьяДвиженияДенежныхСредств,
	|	НЕОПРЕДЕЛЕНО КАК ВалютаКонвертации,
	|	НЕОПРЕДЕЛЕНО КАК СуммаКонвертации,
	|	НЕОПРЕДЕЛЕНО КАК КурсКонвертации,
	|	НЕОПРЕДЕЛЕНО КАК КратностьКурсаКонвертации,
	|	НЕОПРЕДЕЛЕНО КАК ПланированиеСуммы,
	|	НЕОПРЕДЕЛЕНО КАК НомерВедомостиНаВыплатуЗарплаты,
	|	НЕОПРЕДЕЛЕНО КАК ДатаВедомостиНаВыплатуЗарплаты,
	|	НЕОПРЕДЕЛЕНО КАК СтатьяАктивовПассивов,
	|	НЕОПРЕДЕЛЕНО КАК АналитикаАктивовПассивов,
	|	НЕОПРЕДЕЛЕНО КАК ИдентификаторПлатежа,
	|	НЕОПРЕДЕЛЕНО КАК ДатаАвансовогоОтчета,
	//++ НЕ УТ
	|	ЛОЖЬ         КАК ДоговорСУчастникомГОЗ,
	|	ЛОЖЬ         КАК ПлатежиПо275ФЗ,
	|	НЕОПРЕДЕЛЕНО КАК ТипПлатежаФЗ275,
	|	НЕОПРЕДЕЛЕНО КАК ГосКонтракт,
	|	НЕОПРЕДЕЛЕНО КАК СтатьяЦелевыхСредств,
	//-- НЕ УТ
	|	НЕОПРЕДЕЛЕНО КАК ПеречислениеВБюджет,
	|	НЕОПРЕДЕЛЕНО КАК ТипНалога,
	|	НЕОПРЕДЕЛЕНО КАК НДФЛПоВедомостям,
	|	НЕОПРЕДЕЛЕНО КАК РегистрацияВНалоговомОргане,
	|	НЕОПРЕДЕЛЕНО КАК ВидПеречисленияВБюджет,
	|	НЕОПРЕДЕЛЕНО КАК КодОКАТО,
	|	НЕОПРЕДЕЛЕНО КАК ПоказательОснования,
	|	НЕОПРЕДЕЛЕНО КАК ПоказательПериода,
	|	НЕОПРЕДЕЛЕНО КАК ПоказательНомера,
	|	НЕОПРЕДЕЛЕНО КАК ПоказательДаты,
	|	НЕОПРЕДЕЛЕНО КАК ПоказательТипа,
	|	НЕОПРЕДЕЛЕНО КАК СтатусСоставителя,
	|	НЕОПРЕДЕЛЕНО КАК КодБК,
	|	НЕОПРЕДЕЛЕНО КАК КодВидаДохода,
	|	НЕОПРЕДЕЛЕНО КАК КодВыплат,
	|	НЕОПРЕДЕЛЕНО КАК ДоговорЭквайринга,
	|	НЕОПРЕДЕЛЕНО КАК ОтражатьКомиссию,
	|	НЕОПРЕДЕЛЕНО КАК СуммаКомиссии,
	|	НЕОПРЕДЕЛЕНО КАК СтатьяРасходов,
	|	НЕОПРЕДЕЛЕНО КАК АналитикаРасходов,
	|	НЕОПРЕДЕЛЕНО КАК ПодразделениеРасходов,
	//++ НЕ УТ
	|	НЕОПРЕДЕЛЕНО КАК НастройкаСчетовУчета,
	//-- НЕ УТ
	|	ЛОЖЬ КАК ЭтоВыплатаЗарплаты,
	|	Заявка.Сотрудник.Наименование КАК Выдать,
	|	ИСТИНА КАК ОплатаПоЗаявкам,
	|	НЕОПРЕДЕЛЕНО КАК ИННПлательщика,
	|	НЕОПРЕДЕЛЕНО КАК КПППлательщика,
	|	""""         КАК ТекстПлательщика,
	|	НЕОПРЕДЕЛЕНО КАК ГруппаФинансовогоУчета,
	|	НЕОПРЕДЕЛЕНО КАК НаправлениеДеятельности,
	|	НЕОПРЕДЕЛЕНО КАК Договор,
	|	Заявка.Ссылка КАК ЗаявкаНаРасходованиеДенежныхСредств,
	|	НЕОПРЕДЕЛЕНО КАК ДокументОснованиеЗаявки,
	|	НЕОПРЕДЕЛЕНО КАК ИдентификаторОплатыСБП,
	|	НЕОПРЕДЕЛЕНО КАК ОчередностьПлатежа,
	|	НЕОПРЕДЕЛЕНО КАК ТипКомиссииЗаПеревод,
	|	""""         КАК ИнформацияПолучателюПлатежа,
	|	НЕОПРЕДЕЛЕНО КАК УсловиеСделкиКонвертации,
	|	НЕОПРЕДЕЛЕНО КАК БанковскийСчетСписанияКомиссии,
	|	НЕОПРЕДЕЛЕНО КАК НалогообложениеНДС,
	|	ЛОЖЬ,
	|	ЛОЖЬ,
	|	ЛОЖЬ,
	|	ЛОЖЬ,
	|	ЛОЖЬ
	|
	|ИЗ
	|	Документ.ЗаявкаНаКомандировку КАК Заявка
	|	
	|ГДЕ
	|	Заявка.Ссылка В (&МассивСсылок)
	|;
	|
	|//////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЕСТЬNULL(ДенежныеСредства.СуммаОстаток, 0) КАК Сумма
	|ИЗ
	|	ДенежныеСредстваОстаток КАК ДенежныеСредства
	|";
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = ЗапросОстатков.МенеджерВременныхТаблиц;
	Запрос.Текст = ТекстЗапроса;
	Запрос.УстановитьПараметр("МассивСсылок", МассивСсылок);
	
	УстановитьПривилегированныйРежим(Истина);
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	УстановитьПривилегированныйРежим(Ложь);
	
	ДанныеЗаполнения = Новый Структура;
	Для Каждого Колонка Из РезультатЗапроса[0].Колонки Цикл
		ДанныеЗаполнения.Вставить(Колонка.Имя);
	КонецЦикла;
	
	Выборка = РезультатЗапроса[0].Выбрать();
	Если Выборка.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(ДанныеЗаполнения, Выборка);
	Иначе
		Возврат;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Выборка.ФормаОплатыЗаявки)
		И ФормаОплаты <> Выборка.ФормаОплатыЗаявки Тогда
		Текст = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Форма оплаты ""%1"" вводимого документа отличается от формы оплаты ""%2"" заявки.'"),
			ФормаОплаты,
			Выборка.ФормаОплатыЗаявки);
		ВызватьИсключение Текст;
	КонецЕсли;
	
	Если ФормаОплаты = Перечисления.ФормыОплаты.ПлатежнаяКарта
		И Выборка.ХозяйственнаяОперация <> Перечисления.ХозяйственныеОперации.ВозвратОплатыКлиенту Тогда
		Текст = НСтр("ru = 'Выбранная операция не соответствует операции возврата оплаты клиенту, для которой предусмотрен эквайринговый платеж.'");
		ВызватьИсключение Текст;
	КонецЕсли;
	
	//++ НЕ УТ
	Если ЗначениеЗаполнено(Выборка.НастройкаСчетовУчета) Тогда
		ДанныеЗаполнения.НастройкаСчетовУчета = НастройкаСчетовУчетаСервер.КопияНастройкиСчетовУчета(Выборка.НастройкаСчетовУчета);
	КонецЕсли;
	//-- НЕ УТ
	
	Если ЗначениеЗаполнено(БанковскийСчетКасса) Тогда
		Если ФормаОплаты = Перечисления.ФормыОплаты.Безналичная Тогда
			ДанныеЗаполнения.Вставить("БанковскийСчет", БанковскийСчетКасса);
		ИначеЕсли ФормаОплаты = Перечисления.ФормыОплаты.Наличная Тогда
			ДанныеЗаполнения.Вставить("Касса", БанковскийСчетКасса);
		КонецЕсли;
	КонецЕсли;
	
	Если ДанныеЗаполнения.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.КонвертацияВалюты Тогда
		БанковскийСчетПолучатель = Справочники.БанковскиеСчетаОрганизаций.ПолучитьБанковскийСчетОрганизацииПоУмолчанию(
			ДанныеЗаполнения.Организация,
			ДанныеЗаполнения.ВалютаКонвертации);
		ДанныеЗаполнения.Вставить("БанковскийСчетПолучатель", БанковскийСчетПолучатель);
		КассаПолучатель = Справочники.Кассы.ПолучитьКассуПоУмолчанию(
			ДанныеЗаполнения.Организация,
			ДанныеЗаполнения.ВалютаКонвертации);
		ДанныеЗаполнения.Вставить("КассаПолучатель", КассаПолучатель);
	КонецЕсли;
	
	Если ДанныеЗаполнения.ПланированиеСуммы <> Перечисления.СпособыПланированияОплатыЗаявок.ВВалютеВзаиморасчетов Тогда
		ДанныеЗаполнения.ПлатежСКонвертацией = ОпределитьПлатежСКонвертацией(ДанныеЗаполнения);
	КонецЕсли;
	
	Если ДанныеЗаполнения.ПлатежСКонвертацией Тогда
		
		Если ЗначениеЗаполнено(ДанныеЗаполнения.БанковскийСчетКонтрагента)
			И ДанныеЗаполнения.Валюта <> ДанныеЗаполнения.БанковскийСчетКонтрагентаВалюта Тогда
			ДанныеЗаполнения.БанковскийСчетКонтрагента = Справочники.БанковскиеСчетаКонтрагентов.ПустаяСсылка();
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ДанныеЗаполнения.БанковскийСчетПолучатель)
			И ДанныеЗаполнения.Валюта <> ДанныеЗаполнения.БанковскийСчетПолучательВалюта Тогда
			ДанныеЗаполнения.БанковскийСчетПолучатель = Справочники.БанковскиеСчетаОрганизаций.ПустаяСсылка();
		КонецЕсли;
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(СуммаПлатежа) Тогда
		ДанныеЗаполнения.Вставить("СуммаДокумента", СуммаПлатежа);
	Иначе
		ДанныеЗаполнения.Вставить("СуммаДокумента", РезультатЗапроса[1].Выгрузить()[0].Сумма);
	КонецЕсли;
	
	Если Выборка.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ВыдачаДенежныхСредствПодотчетнику
		Или Выборка.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ВыдачаЗаймаСотруднику Тогда
		
		УстановитьПривилегированныйРежим(Истина);
		ДокументФизическогоЛица = ФизическиеЛицаУТ.ПолучитьДокументФизическогоЛицаПоУмолчанию(Выборка.ПодотчетноеЛицо).Представление;
		УстановитьПривилегированныйРежим(Ложь);
		ДанныеЗаполнения.Вставить("ПоДокументу", ДокументФизическогоЛица);
	КонецЕсли;
	
	Если ДанныеЗаполнения.СписокФизЛиц
		И ПолучитьФункциональнуюОпцию("ИспользоватьПеречислениеДенежныхСредствСпискуСотрудников") Тогда
		ОстаткиКСписанию = ОстаткиСписанияНаЛицевыеСчетаСотрудников(МассивСсылок);
		ДанныеЗаполнения.Вставить("ЛицевыеСчетаСотрудников", ОстаткиКСписанию);
	КонецЕсли;
	
	Если Выборка.ПланированиеСуммы = Перечисления.СпособыПланированияОплатыЗаявок.ВВалютеВзаиморасчетов Тогда
		ЗаполнитьРеквизитыДокументаПоФормеОплаты(ФормаОплаты, ДанныеЗаполнения);
	Иначе
		ЗаполнитьРеквизитыДокументаПоФормеОплаты(ФормаОплаты, ДанныеЗаполнения, Выборка.Валюта);
	КонецЕсли;
	
	Если ДанныеЗаполнения.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.КонвертацияВалюты
		И ДанныеЗаполнения.КурсКонвертации <> 0
		И ДанныеЗаполнения.СуммаКонвертации = 0 Тогда
		ДанныеЗаполнения.Вставить("СуммаКонвертации", ДанныеЗаполнения.СуммаДокумента / ДанныеЗаполнения.КурсКонвертации);
	КонецЕсли;
	
	//++ Локализация

	//++ НЕ УТ
	Если Выборка.ПлатежиПо275ФЗ И Выборка.ДоговорСУчастникомГОЗ
		И ЗначениеЗаполнено(Выборка.ГосКонтракт) Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = "
		|ВЫБРАТЬ
		|	Ссылка
		|ИЗ
		|	Справочник.ДоговорыКонтрагентов
		|ГДЕ
		|	ГосударственныйКонтракт = &Госконтракт
		|	И ТипДоговора = ЗНАЧЕНИЕ(Перечисление.ТипыДоговоров.СПокупателем)
		|	И НЕ ПометкаУдаления
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	Ссылка
		|ИЗ
		|	Справочник.ДоговорыМеждуОрганизациями
		|ГДЕ
		|	ГосударственныйКонтракт = &Госконтракт
		|	И НЕ ПометкаУдаления
		|";
		Запрос.УстановитьПараметр("Госконтракт", Выборка.ГосКонтракт);
		
		Результат = Запрос.Выполнить().Выгрузить();
		Если Результат.Количество() = 1 Тогда
			ДанныеЗаполнения.Вставить("ДоговорСЗаказчиком", Результат[0]["Ссылка"]);
		КонецЕсли;
	КонецЕсли;
	//-- НЕ УТ

	//-- Локализация

	Коэффициенты = РаботаСКурсамиВалютУТ.ПолучитьКоэффициентыПересчетаВалюты(
			Выборка.ВалютаЗаявки, ДанныеЗаполнения.Валюта, ТекущаяДатаСеанса(), Выборка.Организация);
	
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ
#Вставка
	//|	РасшифровкаПлатежа.ЗаявкаНаРасходованиеДенежныхСредств КАК ЗаявкаНаРасходованиеДенежныхСредств,
	////|	РасшифровкаПлатежа.Комментарий КАК Комментарий,
	//|
#КонецВставки
	|	РасшифровкаДокумента.Партнер,
	|	РасшифровкаДокумента.Контрагент,
	|	ЕСТЬNULL(РасшифровкаДокумента.ОбъектРасчетов, ЗНАЧЕНИЕ(Справочник.ОбъектыРасчетов.ПустаяСсылка)) КАК ОбъектРасчетов,
	|	ЕСТЬNULL(РасшифровкаДокумента.Сумма, Заявка.СуммаДокумента) КАК Сумма,
	|	ВЫБОР
	|		КОГДА Заявка.ПланированиеСуммы = ЗНАЧЕНИЕ(Перечисление.СпособыПланированияОплатыЗаявок.ВВалютеВзаиморасчетов) ТОГДА
	|			РасшифровкаДокумента.СуммаВзаиморасчетов
	|		ИНАЧЕ
	|			0
	|	КОНЕЦ КАК СуммаВзаиморасчетов,
	|	РасшифровкаДокумента.ВалютаВзаиморасчетов,
	|	РасшифровкаДокумента.СтатьяРасходов,
	|	РасшифровкаДокумента.АналитикаРасходов,
	|	РасшифровкаДокумента.АналитикаАктивовПассивов,
	|	ЕСТЬNULL(РасшифровкаДокумента.СтатьяДвиженияДенежныхСредств, Заявка.СтатьяДвиженияДенежныхСредств) КАК СтатьяДвиженияДенежныхСредств,
	//++ НЕ УТ
	|	РасшифровкаДокумента.СтатьяЦелевыхСредств,
	//-- НЕ УТ
	|	РасшифровкаДокумента.ДоговорКредитаДепозита,
	|	РасшифровкаДокумента.ТипСуммыКредитаДепозита,
	|	РасшифровкаДокумента.ДоговорАренды,
	|	РасшифровкаДокумента.ТипПлатежаПоАренде,
	|	РасшифровкаДокумента.ДоговорЗаймаСотруднику,
	|	РасшифровкаДокумента.Подразделение,
	|	РасшифровкаДокумента.НаправлениеДеятельности,
	|	РасшифровкаДокумента.Ведомость,
	//++ НЕ УТ
	|	&ПоляСубконто,
	//-- НЕ УТ
	|	РасшифровкаДокумента.СтавкаНДС,
	|	РасшифровкаДокумента.СуммаНДС КАК СуммаНДС,
	|	Заявка.Ссылка КАК ЗаявкаНаРасходованиеДенежныхСредств,
	|	Заявка.ПланированиеСуммы КАК ПланированиеСуммы,
	|	Заявка.Валюта КАК Валюта,
#Вставка
	|	ВЫРАЗИТЬ(РасшифровкаДокумента.Комментарий КАК СТРОКА(100)) КАК Комментарий,
#КонецВставки
	|	РасшифровкаДокумента.ДатаПогашения КАК ДатаПогашения
	|ПОМЕСТИТЬ ВтРасшифровкаПлатежа
	|ИЗ
	|	Документ.ЗаявкаНаРасходованиеДенежныхСредств КАК Заявка
	|	
	|	ЛЕВОЕ СОЕДИНЕНИЕ
	|		Документ.ЗаявкаНаРасходованиеДенежныхСредств.РасшифровкаПлатежа КАК РасшифровкаДокумента
	|	ПО
	|		РасшифровкаДокумента.Ссылка = Заявка.Ссылка
	|	
	|ГДЕ
	|	Заявка.Ссылка В(&МассивСсылок)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	НЕОПРЕДЕЛЕНО,
	|	ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка),
	|	ЗНАЧЕНИЕ(Справочник.ОбъектыРасчетов.ПустаяСсылка),
	|	ЕСТЬNULL(РасшифровкаПлатежа.Сумма, Заявка.СуммаДокумента) КАК Сумма,
	|	0 КАК СуммаВзаиморасчетов,
	|	Заявка.Валюта,
	|	НЕОПРЕДЕЛЕНО,
	|	НЕОПРЕДЕЛЕНО,
	|	НЕОПРЕДЕЛЕНО,
	|	РасшифровкаПлатежа.СтатьяДвиженияДенежныхСредств,
	//++ НЕ УТ
	|	НЕОПРЕДЕЛЕНО,
	//-- НЕ УТ
	|	НЕОПРЕДЕЛЕНО,
	|	НЕОПРЕДЕЛЕНО,
	|	НЕОПРЕДЕЛЕНО,
	|	НЕОПРЕДЕЛЕНО,
	|	НЕОПРЕДЕЛЕНО,
	|	НЕОПРЕДЕЛЕНО,
	|	НЕОПРЕДЕЛЕНО,
	|	НЕОПРЕДЕЛЕНО,
	//++ НЕ УТ
	|	&ПоляНеопределено,
	//-- НЕ УТ
	|	ЗНАЧЕНИЕ(Справочник.СтавкиНДС.БезНДС),
	|	0,
	|	Заявка.Ссылка КАК ЗаявкаНаРасходованиеДенежныхСредств,
	|	НЕОПРЕДЕЛЕНО КАК ПланированиеСуммы,
	|	Заявка.Валюта КАК Валюта,
#Вставка
	|	ВЫРАЗИТЬ(РасшифровкаДокумента.Комментарий КАК СТРОКА(100)) КАК Комментарий,
#КонецВставки
	|	ДАТАВРЕМЯ(1, 1, 1) КАК ДатаПогашения
	|ИЗ
	|	Документ.ЗаявкаНаКомандировку КАК Заявка
	|	ЛЕВОЕ СОЕДИНЕНИЕ
	|		Документ.ЗаявкаНаКомандировку.ВыдачаПодОтчет КАК РасшифровкаПлатежа
	|	ПО
	|		РасшифровкаПлатежа.Ссылка = Заявка.Ссылка
	|ГДЕ
	|	Заявка.Ссылка В(&МассивСсылок)
	|	
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	РасшифровкаДокумента.Партнер,
	|	РасшифровкаДокумента.Контрагент,
	|	ВЫБОР
	|		КОГДА РасшифровкаДокумента.ОбъектРасчетов.Объект = РасшифровкаДокумента.Ссылка
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.ОбъектыРасчетов.ПустаяСсылка)
	|		ИНАЧЕ РасшифровкаДокумента.ОбъектРасчетов
	|	КОНЕЦ,
	|	-РасшифровкаДокумента.Сумма,
	|	ВЫБОР
	|		КОГДА РасшифровкаДокумента.ЗаявкаНаРасходованиеДенежныхСредств.ПланированиеСуммы = ЗНАЧЕНИЕ(Перечисление.СпособыПланированияОплатыЗаявок.ВВалютеВзаиморасчетов) ТОГДА
	|			-РасшифровкаДокумента.СуммаВзаиморасчетов
	|		ИНАЧЕ
	|			0
	|	КОНЕЦ КАК СуммаВзаиморасчетов,
	|	РасшифровкаДокумента.ВалютаВзаиморасчетов,
	|	РасшифровкаДокумента.СтатьяРасходов,
	|	РасшифровкаДокумента.АналитикаРасходов,
	|	РасшифровкаДокумента.АналитикаАктивовПассивов,
	|	РасшифровкаДокумента.СтатьяДвиженияДенежныхСредств,
	//++ НЕ УТ
	|	РасшифровкаДокумента.СтатьяЦелевыхСредств,
	//-- НЕ УТ
	|	РасшифровкаДокумента.ДоговорКредитаДепозита,
	|	РасшифровкаДокумента.ТипСуммыКредитаДепозита,
	|	РасшифровкаДокумента.ДоговорАренды,
	|	РасшифровкаДокумента.ТипПлатежаПоАренде,
	|	РасшифровкаДокумента.ДоговорЗаймаСотруднику,
	|	РасшифровкаДокумента.Подразделение,
	|	РасшифровкаДокумента.НаправлениеДеятельности,
	|	РасшифровкаДокумента.Ведомость,
	//++ НЕ УТ
	|	&ПоляСубконто,
	//-- НЕ УТ
	|	РасшифровкаДокумента.СтавкаНДС,
	|	-РасшифровкаДокумента.СуммаНДС,
	|	РасшифровкаДокумента.ЗаявкаНаРасходованиеДенежныхСредств,
	|	РасшифровкаДокумента.ЗаявкаНаРасходованиеДенежныхСредств.ПланированиеСуммы,
	|	РасшифровкаДокумента.ЗаявкаНаРасходованиеДенежныхСредств.Валюта,
#Вставка
	|	ВЫРАЗИТЬ(РасшифровкаДокумента.Комментарий КАК СТРОКА(100)) КАК Комментарий,
#КонецВставки
	|	ДАТАВРЕМЯ(1, 1, 1) КАК ДатаПогашения
	|ИЗ
	|	Документ.СписаниеБезналичныхДенежныхСредств.РасшифровкаПлатежа КАК РасшифровкаДокумента
	|	
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		РегистрНакопления.ДенежныеСредстваКВыплате КАК ДенежныеСредства
	|	ПО
	|		ДенежныеСредства.Регистратор = РасшифровкаДокумента.Ссылка
	|		И ДенежныеСредства.ЗаявкаНаРасходованиеДенежныхСредств = РасшифровкаДокумента.ЗаявкаНаРасходованиеДенежныхСредств
	|		
	|ГДЕ
	|	ДенежныеСредства.ЗаявкаНаРасходованиеДенежныхСредств В(&МассивСсылок)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	РасшифровкаДокумента.Партнер,
	|	ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка),
	|	ВЫБОР
	|		КОГДА РасшифровкаДокумента.ОбъектРасчетов.Объект = РасшифровкаДокумента.Ссылка
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.ОбъектыРасчетов.ПустаяСсылка)
	|		ИНАЧЕ РасшифровкаДокумента.ОбъектРасчетов
	|	КОНЕЦ,
	|	-РасшифровкаДокумента.Сумма,
	|	ВЫБОР
	|		КОГДА РасшифровкаДокумента.ЗаявкаНаРасходованиеДенежныхСредств.ПланированиеСуммы = ЗНАЧЕНИЕ(Перечисление.СпособыПланированияОплатыЗаявок.ВВалютеВзаиморасчетов) ТОГДА
	|			-РасшифровкаДокумента.СуммаВзаиморасчетов
	|		ИНАЧЕ
	|			0
	|	КОНЕЦ КАК СуммаВзаиморасчетов,
	|	РасшифровкаДокумента.ВалютаВзаиморасчетов,
	|	РасшифровкаДокумента.СтатьяРасходов,
	|	РасшифровкаДокумента.АналитикаРасходов,
	|	РасшифровкаДокумента.АналитикаАктивовПассивов,
	|	РасшифровкаДокумента.СтатьяДвиженияДенежныхСредств,
	//++ НЕ УТ
	|	НЕОПРЕДЕЛЕНО,
	//-- НЕ УТ
	|	РасшифровкаДокумента.ДоговорКредитаДепозита,
	|	РасшифровкаДокумента.ТипСуммыКредитаДепозита,
	|	РасшифровкаДокумента.ДоговорАренды,
	|	РасшифровкаДокумента.ТипПлатежаПоАренде,
	|	РасшифровкаДокумента.ДоговорЗаймаСотруднику,
	|	РасшифровкаДокумента.Подразделение,
	|	РасшифровкаДокумента.НаправлениеДеятельности,
	|	РасшифровкаДокумента.Ссылка.Ведомость,
	//++ НЕ УТ
	|	&ПоляСубконто,
	//-- НЕ УТ
	|	РасшифровкаДокумента.СтавкаНДС,
	|	-РасшифровкаДокумента.СуммаНДС,
	|	РасшифровкаДокумента.ЗаявкаНаРасходованиеДенежныхСредств,
	|	РасшифровкаДокумента.ЗаявкаНаРасходованиеДенежныхСредств.ПланированиеСуммы,
	|	РасшифровкаДокумента.ЗаявкаНаРасходованиеДенежныхСредств.Валюта,
#Вставка
	|	ВЫРАЗИТЬ(РасшифровкаДокумента.Комментарий КАК СТРОКА(100)) КАК Комментарий,
#КонецВставки
	|	ДАТАВРЕМЯ(1, 1, 1) КАК ДатаПогашения
	|ИЗ
	|	Документ.РасходныйКассовыйОрдер.РасшифровкаПлатежа КАК РасшифровкаДокумента
	|	
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		РегистрНакопления.ДенежныеСредстваКВыплате КАК ДенежныеСредства
	|	ПО
	|		ДенежныеСредства.Регистратор = РасшифровкаДокумента.Ссылка
	|		И ДенежныеСредства.ЗаявкаНаРасходованиеДенежныхСредств = РасшифровкаДокумента.ЗаявкаНаРасходованиеДенежныхСредств
	|ГДЕ
	|	ДенежныеСредства.ЗаявкаНаРасходованиеДенежныхСредств В(&МассивСсылок)
	|;
	|
	|//////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КурсДоговора.Период КАК Период,
	|	КурсДоговора.Договор КАК Договор,
	|	КурсДоговора.КурсЧислитель КАК КурсЧислитель,
	|	КурсДоговора.КурсЗнаменатель КАК КурсЗнаменатель
	|ПОМЕСТИТЬ втКурсыДоговоров
	|ИЗ
	|	РегистрСведений.КурсыВалютРасчетовПоДоговорам.СрезПоследних(&ТекущаяДата) КАК КурсДоговора
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОбъектыРасчетов.Ссылка КАК ОбъектРасчетов,
	|	ВЫБОР
	|		КОГДА ОбъектыРасчетов.ТипОбъектаРасчетов = ЗНАЧЕНИЕ(Перечисление.ТипыОбъектовРасчетов.Накладная)
	|				И ЕСТЬNULL(ОбъектыРасчетов.Договор.ВариантКурсаДоговора, ЗНАЧЕНИЕ(Перечисление.ВариантыКурсаДоговора.Переменный)) 
	|					= ЗНАЧЕНИЕ(Перечисление.ВариантыКурсаДоговора.ФиксированныйНаДатуОтгрузки)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ВариантыКурсаДоговора.ФиксированныйНаДатуОтгрузки)
	|		ИНАЧЕ ЕСТЬNULL(ОбъектыРасчетов.Договор.ВариантКурсаДоговора, ЗНАЧЕНИЕ(Перечисление.ВариантыКурсаДоговора.Переменный))
	|	КОНЕЦ                                                                  КАК ВариантКурсаДоговора,
	|	ОбъектыРасчетов.ТипОбъектаРасчетов                                     КАК ТипОбъектаРасчетов,
	|	ЕСТЬNULL(КурсыДокументов.КурсЧислительВалютыВзаиморасчетов, 0)         КАК КурсЧислительВалютыВзаиморасчетов,
	|	ЕСТЬNULL(КурсыДокументов.КурсЗнаменательВалютыВзаиморасчетов, 0)       КАК КурсЗнаменательВалютыВзаиморасчетов,
	|	ЕСТЬNULL(КурсыДокументов.КурсЧислительВалютыУправленческогоУчета, 0)   КАК КурсЧислительВалютыУправленческогоУчета,
	|	ЕСТЬNULL(КурсыДокументов.КурсЗнаменательВалютыУправленческогоУчета, 0) КАК КурсЗнаменательВалютыУправленческогоУчета,
	|	ЕСТЬNULL(КурсыДокументов.КурсЧислительВалютыДокумента, 0)              КАК КурсЧислительВалютыДокумента,
	|	ЕСТЬNULL(КурсыДокументов.КурсЗнаменательВалютыДокумента, 0)            КАК КурсЗнаменательВалютыДокумента,
	|	ЕСТЬNULL(КурсыДокументов.ВалютаДокумента, 0)                           КАК ВалютаДокумента,
	|	ОбъектыРасчетов.ВалютаВзаиморасчетов                                   КАК ВалютаВзаиморасчетов,
	|	ОбъектыРасчетов.Организация.ВалютаРегламентированногоУчета             КАК ВалютаРегламентированногоУчета,
	|	ОбъектыРасчетов.Дата                                                   КАК Дата,
	|	ЕСТЬNULL(КурсыДоговоров.Период, ДАТАВРЕМЯ(1, 1, 1))                    КАК ПериодКурсаДоговора,
	|	ЕСТЬNULL(КурсыДоговоров.КурсЧислитель, 0)                              КАК КурсЧислительВалютыДоговора,
	|	ЕСТЬNULL(КурсыДоговоров.КурсЗнаменатель, 0)                            КАК КурсЗнаменательВалютыДоговора
	|ПОМЕСТИТЬ ДанныеОбъектаРасчетов
	|ИЗ
	|	Справочник.ОбъектыРасчетов КАК ОбъектыРасчетов
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ВалютыИКурсыДокументов КАК КурсыДокументов
	|		ПО ОбъектыРасчетов.Объект = КурсыДокументов.Документ
	|		ЛЕВОЕ СОЕДИНЕНИЕ втКурсыДоговоров КАК КурсыДоговоров
	|		ПО ОбъектыРасчетов.Договор = КурсыДоговоров.Договор
	|ГДЕ
	|	ОбъектыРасчетов.Ссылка В (ВЫБРАТЬ Т.ОбъектРасчетов Из ВтРасшифровкаПлатежа КАК Т)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДанныеОбъектаРасчетов.ВалютаДокумента                КАК Валюта,
	|	ДанныеОбъектаРасчетов.ОбъектРасчетов                 КАК ОбъектРасчетов,
	|	ДанныеОбъектаРасчетов.ВалютаРегламентированногоУчета КАК БазоваяВалюта,
	|	ДанныеОбъектаРасчетов.Дата                           КАК ДатаКурса,
	|	ДанныеОбъектаРасчетов.КурсЧислительВалютыДокумента   КАК КурсЧислитель,
	|	ДанныеОбъектаРасчетов.КурсЗнаменательВалютыДокумента КАК КурсЗнаменатель
	|ПОМЕСТИТЬ ВтКурсыПредварительно
	|ИЗ
	|	ДанныеОбъектаРасчетов КАК ДанныеОбъектаРасчетов
	|ГДЕ
	|	ДанныеОбъектаРасчетов.ВариантКурсаДоговора = ЗНАЧЕНИЕ(Перечисление.ВариантыКурсаДоговора.ФиксированныйНаДатуОтгрузки)
	|	И ДанныеОбъектаРасчетов.ТипОбъектаРасчетов = ЗНАЧЕНИЕ(Перечисление.ТипыОбъектовРасчетов.Накладная)
	|	И (ДанныеОбъектаРасчетов.ВалютаДокумента В (ВЫБРАТЬ Т.Валюта Из ВтРасшифровкаПлатежа КАК Т)
	|		ИЛИ ДанныеОбъектаРасчетов.ВалютаДокумента = &Валюта)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ДанныеОбъектаРасчетов.ВалютаВзаиморасчетов                КАК Валюта,
	|	ДанныеОбъектаРасчетов.ОбъектРасчетов                      КАК ОбъектРасчетов,
	|	ДанныеОбъектаРасчетов.ВалютаРегламентированногоУчета      КАК БазоваяВалюта,
	|	ДанныеОбъектаРасчетов.Дата                                КАК ДатаКурса,
	|	ДанныеОбъектаРасчетов.КурсЧислительВалютыВзаиморасчетов   КАК КурсЧислитель,
	|	ДанныеОбъектаРасчетов.КурсЗнаменательВалютыВзаиморасчетов КАК КурсЗнаменатель
	|ИЗ
	|	ДанныеОбъектаРасчетов КАК ДанныеОбъектаРасчетов
	|ГДЕ
	|	ДанныеОбъектаРасчетов.ВариантКурсаДоговора = ЗНАЧЕНИЕ(Перечисление.ВариантыКурсаДоговора.ФиксированныйНаДатуОтгрузки)
	|	И ДанныеОбъектаРасчетов.ТипОбъектаРасчетов = ЗНАЧЕНИЕ(Перечисление.ТипыОбъектовРасчетов.Накладная)
	|	И (ДанныеОбъектаРасчетов.ВалютаВзаиморасчетов В(ВЫБРАТЬ Т.Валюта Из ВтРасшифровкаПлатежа КАК Т)
	|		ИЛИ ДанныеОбъектаРасчетов.ВалютаВзаиморасчетов = &Валюта)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	&ВалютаУпр                                                      КАК Валюта,
	|	ДанныеОбъектаРасчетов.ОбъектРасчетов                            КАК ОбъектРасчетов,
	|	ДанныеОбъектаРасчетов.ВалютаРегламентированногоУчета            КАК БазоваяВалюта,
	|	ДанныеОбъектаРасчетов.Дата                                      КАК ДатаКурса,
	|	ДанныеОбъектаРасчетов.КурсЧислительВалютыУправленческогоУчета   КАК КурсЧислитель,
	|	ДанныеОбъектаРасчетов.КурсЗнаменательВалютыУправленческогоУчета КАК КурсЗнаменатель
	|ИЗ
	|	ДанныеОбъектаРасчетов КАК ДанныеОбъектаРасчетов
	|ГДЕ
	|	ДанныеОбъектаРасчетов.ВариантКурсаДоговора = ЗНАЧЕНИЕ(Перечисление.ВариантыКурсаДоговора.ФиксированныйНаДатуОтгрузки)
	|	И ДанныеОбъектаРасчетов.ТипОбъектаРасчетов = ЗНАЧЕНИЕ(Перечисление.ТипыОбъектовРасчетов.Накладная)
	|	И (&ВалютаУпр В (ВЫБРАТЬ Т.Валюта Из ВтРасшифровкаПлатежа КАК Т)
	|		ИЛИ &ВалютаУпр = &Валюта)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ДанныеОбъектаРасчетов.ВалютаВзаиморасчетов           КАК Валюта,
	|	ДанныеОбъектаРасчетов.ОбъектРасчетов                 КАК ОбъектРасчетов,
	|	ДанныеОбъектаРасчетов.ВалютаРегламентированногоУчета КАК БазоваяВалюта,
	|	ДанныеОбъектаРасчетов.ПериодКурсаДоговора            КАК ДатаКурса,
	|	ДанныеОбъектаРасчетов.КурсЧислительВалютыДоговора    КАК КурсЧислитель,
	|	ДанныеОбъектаРасчетов.КурсЗнаменательВалютыДоговора  КАК КурсЗнаменатель
	|ИЗ
	|	ДанныеОбъектаРасчетов КАК ДанныеОбъектаРасчетов
	|ГДЕ
	|	ДанныеОбъектаРасчетов.ВариантКурсаДоговора = ЗНАЧЕНИЕ(Перечисление.ВариантыКурсаДоговора.УстановленныйВДоговоре)
	|	И (ДанныеОбъектаРасчетов.ВалютаВзаиморасчетов В(ВЫБРАТЬ Т.Валюта Из ВтРасшифровкаПлатежа КАК Т)
	|		ИЛИ ДанныеОбъектаРасчетов.ВалютаВзаиморасчетов = &Валюта)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВтКурсыПредварительно.Валюта          КАК Валюта,
	|	ВтКурсыПредварительно.ОбъектРасчетов  КАК ОбъектРасчетов,
	|	ВтКурсыПредварительно.БазоваяВалюта   КАК БазоваяВалюта,
	|	ВтКурсыПредварительно.ДатаКурса       КАК ДатаКурса,
	|	ВтКурсыПредварительно.КурсЧислитель   КАК КурсЧислитель,
	|	ВтКурсыПредварительно.КурсЗнаменатель КАК КурсЗнаменатель
	|ПОМЕСТИТЬ КурсыВалют
	|ИЗ
	|	ВтКурсыПредварительно КАК ВтКурсыПредварительно
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ОтносительныеКурсыВалютСрезПоследних.Валюта          КАК Валюта,
	|	ВтРасшифровкаПлатежа.ОбъектРасчетов                  КАК ОбъектРасчетов,
	|	ОтносительныеКурсыВалютСрезПоследних.БазоваяВалюта   КАК БазоваяВалюта,
	|	ОтносительныеКурсыВалютСрезПоследних.Период          КАК ДатаКурса,
	|	ОтносительныеКурсыВалютСрезПоследних.КурсЧислитель   КАК КурсЧислитель,
	|	ОтносительныеКурсыВалютСрезПоследних.КурсЗнаменатель КАК КурсЗнаменатель
	|ИЗ
	|	РегистрСведений.ОтносительныеКурсыВалют.СрезПоследних(
	|			&ТекущаяДата,
	|			БазоваяВалюта = &БазоваяВалюта
	|				И (Валюта В (ВЫБРАТЬ Т.Валюта Из ВтРасшифровкаПлатежа КАК Т)
	|					ИЛИ Валюта = &Валюта)) КАК ОтносительныеКурсыВалютСрезПоследних
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВтРасшифровкаПлатежа КАК ВтРасшифровкаПлатежа
	|		ПО (ИСТИНА)
	|ГДЕ 
	|	НЕ (ОтносительныеКурсыВалютСрезПоследних.Валюта, ВтРасшифровкаПлатежа.ОбъектРасчетов)
	|		В (ВЫБРАТЬ Т.Валюта, Т.ОбъектРасчетов ИЗ ВтКурсыПредварительно КАК Т)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РасшифровкаПлатежа.Партнер,
	|	РасшифровкаПлатежа.Контрагент,
	|	РасшифровкаПлатежа.ОбъектРасчетов,
	|	ВЫБОР
	|		КОГДА РасшифровкаПлатежа.ПланированиеСуммы = ЗНАЧЕНИЕ(Перечисление.СпособыПланированияОплатыЗаявок.ВВалютеВзаиморасчетов) ТОГДА
	|			СУММА(РасшифровкаПлатежа.СуммаВзаиморасчетов) * КурсВалюты.КурсЧислитель * КурсВалютыПересчета.КурсЗнаменатель 
	|				/ (КурсВалюты.КурсЗнаменатель * КурсВалютыПересчета.КурсЧислитель)
	|		ИНАЧЕ
	|			СУММА(РасшифровкаПлатежа.Сумма) * КурсВалюты.КурсЧислитель * КурсВалютыПересчета.КурсЗнаменатель 
	|				/ (КурсВалюты.КурсЗнаменатель * КурсВалютыПересчета.КурсЧислитель)
	|	КОНЕЦ КАК Сумма,
	|	СУММА(РасшифровкаПлатежа.СуммаВзаиморасчетов) КАК СуммаВзаиморасчетов,
	|	РасшифровкаПлатежа.ВалютаВзаиморасчетов,
#Вставка
	|	ВЫРАЗИТЬ(РасшифровкаПлатежа.Комментарий КАК СТРОКА(100)) КАК Комментарий,
#КонецВставки
	|	РасшифровкаПлатежа.СтатьяРасходов,
	|	РасшифровкаПлатежа.АналитикаРасходов,
	|	РасшифровкаПлатежа.АналитикаАктивовПассивов,
	|	РасшифровкаПлатежа.СтатьяДвиженияДенежныхСредств,
	//++ НЕ УТ
	|	РасшифровкаПлатежа.СтатьяЦелевыхСредств,
	//-- НЕ УТ
	|	РасшифровкаПлатежа.ДоговорКредитаДепозита,
	|	РасшифровкаПлатежа.ТипСуммыКредитаДепозита,
	|	РасшифровкаПлатежа.ДоговорАренды,
	|	РасшифровкаПлатежа.ТипПлатежаПоАренде,
	|	РасшифровкаПлатежа.ДоговорЗаймаСотруднику,
	|	РасшифровкаПлатежа.Подразделение,
	|	РасшифровкаПлатежа.НаправлениеДеятельности,
	|	РасшифровкаПлатежа.Ведомость,
	//++ НЕ УТ
	|	&ДанныеСубконто,
	//-- НЕ УТ
	|	РасшифровкаПлатежа.СтавкаНДС,
	|	ВЫБОР
	|		КОГДА РасшифровкаПлатежа.ПланированиеСуммы = ЗНАЧЕНИЕ(Перечисление.СпособыПланированияОплатыЗаявок.ВВалютеВзаиморасчетов) ТОГДА
	|			(СУММА(РасшифровкаПлатежа.СуммаВзаиморасчетов) * КурсВалюты.КурсЧислитель * КурсВалютыПересчета.КурсЗнаменатель 
	|				/ (КурсВалюты.КурсЗнаменатель * КурсВалютыПересчета.КурсЧислитель) *
	|					(РасшифровкаПлатежа.СтавкаНДС.Ставка / 100) / ((РасшифровкаПлатежа.СтавкаНДС.Ставка / 100) + 1))
	|	ИНАЧЕ
	|		СУММА(РасшифровкаПлатежа.СуммаНДС) * КурсВалюты.КурсЧислитель * КурсВалютыПересчета.КурсЗнаменатель 
	|				/ (КурсВалюты.КурсЗнаменатель * КурсВалютыПересчета.КурсЧислитель)
	|	КОНЕЦ КАК СуммаНДС,
	|	РасшифровкаПлатежа.ЗаявкаНаРасходованиеДенежныхСредств,
	|	СУММА(ВЫБОР
	|			КОГДА РасшифровкаПлатежа.ПланированиеСуммы = ЗНАЧЕНИЕ(Перечисление.СпособыПланированияОплатыЗаявок.ВВалютеВзаиморасчетов) 
	|				ТОГДА РасшифровкаПлатежа.СуммаВзаиморасчетов
	|			ИНАЧЕ РасшифровкаПлатежа.Сумма
	|	КОНЕЦ) КАК СуммаПлатежа,
	|	КурсВалюты.КурсЧислитель * КурсВалютыПересчета.КурсЗнаменатель 
	|		/ (КурсВалюты.КурсЗнаменатель * КурсВалютыПересчета.КурсЧислитель) КАК КоэффициентПересчета,
	|	РасшифровкаПлатежа.ДатаПогашения КАК ДатаПогашения
	|
	|ИЗ ВтРасшифровкаПлатежа КАК РасшифровкаПлатежа
	|		
	|		ЛЕВОЕ СОЕДИНЕНИЕ
	|			КурсыВалют КАК КурсВалюты
	|		ПО
	|			РасшифровкаПлатежа.Валюта = КурсВалюты.Валюта
	|			И РасшифровкаПлатежа.ОбъектРасчетов = КурсВалюты.ОбъектРасчетов 
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ
	|			КурсыВалют КАК КурсВалютыПересчета
	|		ПО
	|			&Валюта = КурсВалютыПересчета.Валюта
	|			И РасшифровкаПлатежа.ОбъектРасчетов = КурсВалютыПересчета.ОбъектРасчетов 
	|
	|СГРУППИРОВАТЬ ПО
	|	РасшифровкаПлатежа.Партнер,
	|	РасшифровкаПлатежа.Контрагент,
	|	РасшифровкаПлатежа.ОбъектРасчетов,
	|	РасшифровкаПлатежа.ВалютаВзаиморасчетов,
#Вставка
	|	ВЫРАЗИТЬ(РасшифровкаПлатежа.Комментарий КАК СТРОКА(100)),
#КонецВставки
	|	РасшифровкаПлатежа.СтатьяРасходов,
	|	РасшифровкаПлатежа.АналитикаРасходов,
	|	РасшифровкаПлатежа.АналитикаАктивовПассивов,
	|	РасшифровкаПлатежа.СтатьяДвиженияДенежныхСредств,
	//++ НЕ УТ
	|	РасшифровкаПлатежа.СтатьяЦелевыхСредств,
	//-- НЕ УТ
	|	РасшифровкаПлатежа.ДоговорКредитаДепозита,
	|	РасшифровкаПлатежа.ТипСуммыКредитаДепозита,
	|	РасшифровкаПлатежа.ДоговорАренды,
	|	РасшифровкаПлатежа.ТипПлатежаПоАренде,
	|	РасшифровкаПлатежа.ДоговорЗаймаСотруднику,
	|	РасшифровкаПлатежа.Подразделение,
	|	РасшифровкаПлатежа.НаправлениеДеятельности,
	|	РасшифровкаПлатежа.Ведомость,
	//++ НЕ УТ
	|	&ГруппировкаСубконто,
	//-- НЕ УТ
	|	РасшифровкаПлатежа.СтавкаНДС,
	|	РасшифровкаПлатежа.ЗаявкаНаРасходованиеДенежныхСредств,
	|	РасшифровкаПлатежа.ПланированиеСуммы,
	|	КурсВалюты.КурсЧислитель,
	|	КурсВалюты.КурсЗнаменатель,
	|	КурсВалютыПересчета.КурсЗнаменатель,
	|	КурсВалютыПересчета.КурсЧислитель,
	|	РасшифровкаПлатежа.ДатаПогашения
	|
	|ИМЕЮЩИЕ
	|	ВЫБОР
	|		КОГДА РасшифровкаПлатежа.ПланированиеСуммы = ЗНАЧЕНИЕ(Перечисление.СпособыПланированияОплатыЗаявок.ВВалютеВзаиморасчетов)
	|			ТОГДА СУММА(РасшифровкаПлатежа.СуммаВзаиморасчетов) * КурсВалюты.КурсЧислитель * КурсВалютыПересчета.КурсЗнаменатель 
	|				/ (КурсВалюты.КурсЗнаменатель * КурсВалютыПересчета.КурсЧислитель)
	|		ИНАЧЕ СУММА(РасшифровкаПлатежа.Сумма)
	|	КОНЕЦ > 0
	|	
	|УПОРЯДОЧИТЬ ПО
	|	РасшифровкаПлатежа.ЗаявкаНаРасходованиеДенежныхСредств
	|";
	
	//++ НЕ УТ
	Если ДанныеЗаполнения.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ПеречислениеВБюджет
		И РеглУчетСервер.ВидыНалоговСНастройкойСчетов().Найти(ДанныеЗаполнения.ТипНалога) <> Неопределено
		Или ДанныеЗаполнения.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ПрочаяВыдачаДенежныхСредств Тогда
		
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ГруппировкаСубконто",
		"	РасшифровкаПлатежа.НастройкаСчетовУчета");
		
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ДанныеСубконто",
		"	РасшифровкаПлатежа.НастройкаСчетовУчета КАК НастройкаСчетовУчета");
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ГруппировкаСубконто", "ЛОЖЬ");
		
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ДанныеСубконто",
		"	МИНИМУМ(РасшифровкаПлатежа.НастройкаСчетовУчета) КАК НастройкаСчетовУчета");
	КонецЕсли;
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ПоляСубконто",
		"РасшифровкаДокумента.НастройкаСчетовУчета КАК НастройкаСчетовУчета");
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ПоляНеопределено", "НЕОПРЕДЕЛЕНО КАК НастройкаСчетовУчета");
	//-- НЕ УТ
	
	Запрос.УстановитьПараметр("Валюта", ДанныеЗаполнения.Валюта);
	Запрос.УстановитьПараметр("ВалютаУпр", ЗначениеНастроекПовтИсп.ВалютаУправленческогоУчета());
	Запрос.УстановитьПараметр("МассивСсылок", МассивСсылок);
	Запрос.УстановитьПараметр("ТекущаяДата", ТекущаяДатаСеанса());
	Запрос.УстановитьПараметр("БазоваяВалюта", ЗначениеНастроекПовтИсп.ВалютаРегламентированногоУчетаОрганизации(ДанныеЗаполнения.Организация));
	
	УстановитьПривилегированныйРежим(Истина);
	Выборка = Запрос.Выполнить().Выбрать();
	УстановитьПривилегированныйРежим(Ложь);
	
	ТабличнаяЧасть.Очистить();
	
	// Сумма в валюте заявки пересчитывается в сумму в валюте документа
	// с учетом возможных разных курсов на дату отгрузки или курсов договора
	СуммаПлатежаСтрокРасшифровки = 0;
	СуммаДокумента = 0;
	Пока Выборка.Следующий() Цикл
		Если (СуммаПлатежаСтрокРасшифровки + Выборка.СуммаПлатежа) > ДанныеЗаполнения.СуммаДокумента Тогда
			СуммаДокумента = СуммаДокумента + (ДанныеЗаполнения.СуммаДокумента - СуммаПлатежаСтрокРасшифровки) * Выборка.КоэффициентПересчета;
			Прервать;
		КонецЕсли;
		СуммаПлатежаСтрокРасшифровки = СуммаПлатежаСтрокРасшифровки + Выборка.СуммаПлатежа;
		СуммаДокумента = СуммаДокумента + Выборка.Сумма;
	КонецЦикла;
	
	ОбрабатываемыеСтроки = Новый Массив;
	
	Выборка.Сбросить();
	Пока Выборка.Следующий() Цикл
		Если СуммыКОплате <> Неопределено Тогда
			СуммаЗаявки = СуммыКОплате.Получить(Выборка.ЗаявкаНаРасходованиеДенежныхСредств)
				* Выборка.КоэффициентПересчета;
			Сумма = Мин(Выборка.Сумма, СуммаЗаявки, СуммаДокумента);
		Иначе
			Сумма = Мин(Выборка.Сумма, СуммаДокумента);
		КонецЕсли;
		ПересчитатьНДС = (Сумма <> Выборка.Сумма);
		СуммаДокумента = СуммаДокумента - Сумма;
		Если Сумма > 0 Тогда
			НоваяСтрока = ТабличнаяЧасть.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
			НоваяСтрока.Сумма = Сумма;
			
			Если ПересчитатьНДС Тогда
				ОбрабатываемыеСтроки.Добавить(НоваяСтрока);
			КонецЕсли;
			
			//++ НЕ УТ
			Если ЗначениеЗаполнено(Выборка.НастройкаСчетовУчета) Тогда
				НоваяСтрока.НастройкаСчетовУчета = НастройкаСчетовУчетаСервер.КопияНастройкиСчетовУчета(Выборка.НастройкаСчетовУчета);
			КонецЕсли;
			
			Если Константы.ИспользоватьНачислениеЗарплаты.Получить()
				И ДанныеЗаполнения.Свойство("ХозяйственнаяОперация")
				И ДанныеЗаполнения.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ВыплатаЗарплатыЧерезКассу Тогда
				
				Если ТабличнаяЧасть.Количество() Тогда
					ДанныеЗаполнения.Вставить("Ведомость", Выборка.Ведомость);
				КонецЕсли;
			КонецЕсли;
			//-- НЕ УТ
			
		КонецЕсли;
	КонецЦикла;
	
	КэшированныеЗначения = ПакетнаяОбработкаТабличнойЧастиКлиентСервер.ПолучитьСтруктуруКэшируемыеЗначения();
	
	ПараметрыПересчетаНДС = Новый Структура("ЦенаВключаетНДС", Истина);
	СтруктураДействий = Новый Структура;
	СтруктураДействий.Вставить("ПересчитатьСуммуНДС", ПараметрыПересчетаНДС);
	
	ПакетнаяОбработкаТабличнойЧастиСервер.ОбработатьСтрокиТЧ(
		ОбрабатываемыеСтроки,
		СтруктураДействий,
		ТабличнаяЧасть,
		КэшированныеЗначения);
	
	Если ДанныеЗаполнения.СуммаДокумента <> ТабличнаяЧасть.Итог("СуммаВзаиморасчетов") Тогда
		Для каждого СтрокаТЧ Из ТабличнаяЧасть Цикл
			СтрокаТЧ.СуммаВзаиморасчетов = 0;
		КонецЦикла;
	КонецЕсли;
	
	Если ТабличнаяЧасть.Количество() Тогда
		ДанныеЗаполнения.Вставить("СуммаДокумента", ТабличнаяЧасть.Итог("Сумма"));
	КонецЕсли;
	
	Если ДанныеЗаполнения.СписокКонтрагентов Тогда
	
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ РАЗЛИЧНЫЕ
			|	БанковскиеСчетаКонтрагентов.Контрагент КАК Контрагент,
			|	БанковскиеСчетаКонтрагентов.БанковскийСчетКонтрагента КАК БанковскийСчетКонтрагента
			|ИЗ
			|	Документ.ЗаявкаНаРасходованиеДенежныхСредств КАК ЗаявкаНаРасходованиеДенежныхСредств
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаявкаНаРасходованиеДенежныхСредств.БанковскиеСчетаСпискаКонтрагентов КАК БанковскиеСчетаКонтрагентов
			|		ПО ЗаявкаНаРасходованиеДенежныхСредств.Ссылка = БанковскиеСчетаКонтрагентов.Ссылка
			|ГДЕ
			|	ЗаявкаНаРасходованиеДенежныхСредств.Ссылка В(&МассивСсылок)";
		
		Запрос.УстановитьПараметр("МассивСсылок", МассивСсылок);
		
		ДанныеЗаполнения.Вставить("БанковскиеСчетаСпискаКонтрагентов", Запрос.Выполнить().Выгрузить());
		
	КонецЕсли;
	
КонецПроцедуры
